{"0": "9-686-093 REV: JULY 13, 2006 ROGER BOHN Kristen's Cookie Company (A1)1 You and your roommate are preparing to launch Kristen’s Cookie Company in your on-campus apartment. The company will provide fresh cookies to hungry students late at night. You need to evaluate the preliminary design for the company’s production process in order to make key policy decisions, including what prices to charge, what equipment to order and how many orders to accept, and to determine whether the business can be profitable. Business Concept Your idea is to bake fresh cookies to order, using any combination of ingredients that the buyer wants. The cookies will be ready for pickup at your apartment within an hour. Several factors will set you apart from competing products such as store-bought cookies. First, your cookies will be completely fresh. You will not bake any cookies before receiving the order; therefore, the buyer will be getting cookies that are literally hot out of the oven. Second, like many Boston-based area ice-cream shops, you will have a variety of ingredients available to add to the basic dough, including chocolate chips, M&M’s, chopped Heath bars, coconut, walnuts, and raisins. Buyers will telephone in their orders and specify which of these ingredients they want in their cookies. You will guarantee completely fresh cookies. In short, you will have the freshest, most exotic cookies anywhere, available right on campus. The Production Process Baking cookies is simple: place all the ingredients in a mixing bowl and mix them; spoon the cookie dough onto a tray; put the cookies into the oven; bake them; take the tray of cookies out of the 1 This case is intended to be used with “Kristen’s Cookie Company (A2),” HBS No. 686-094. Professor Roger Bohn prepared this case with the assistance of Research Associates K. Somers and G. Greenberg. HBS cases are developed solely as the basis for class discussion. Cases are not intended to serve as endorsements, sources of primary data, or illustrations of effective or ineffective management. Copyright © 1986 President and Fellows of Harvard College. To order copies or request permission to reproduce materials, call 1-800-545-7685, write Harvard Business School Publishing, Boston, MA 02163, or go to http://www.hbsp.harvard.edu. No part of this publication may be reproduced, stored in a retrieval system, used in a spreadsheet, or transmitted in any form or by any means—electronic, mechanical, photocopying, recording, or otherwise—without the permission of Harvard Business School. This document is authorized for use only by Joel Borellis in Sp23 - NEW VENTURE DSGN/IMPLEMENTATN (06501) at UT Austin MSTC, 2023. Kristen's Cookie Company (A1) oven; let the cookies cool; and, finally, take the cookies off the tray and carefully pack them in a box. You and your roommate already own all the necessary capital equipment: a high-capacity professional-grade electric mixer, cookie trays, and spoons. Your apartment has a small oven that will hold one tray at a time. Your landlord pays for all the electricity. The variable costs, therefore, are merely the cost of the ingredients (estimated to be $0.60/dozen), the cost of the box in which the cookies are packed ($0.10 per box; each box holds a dozen cookies), and your time (what value do you place on your time?). A detailed examination of the production process, which specifies how long each of the steps will take, follows. The first step is to take an order, which will be extremely fast and 100% accurate, since your roommate has devised a method using the campus e-mail system to accept orders and to inform customers when their orders will be ready for pickup. Because this runs automatically on your personal computer, it does not take any of your or your roommate’s time. Therefore, this step will be ignored in further analysis. You and your roommate have timed the necessary physical operations. The first physical production step is to wash out the electric mixer’s bowl and beaters from the previous batch, add the ingredients to the bowl, and turn on the mixer to mix the ingredients. The electric mixer can hold and mix ingredients for up to three dozen cookies. You then spoon the cookies, one dozen at a time, onto a cookie tray. These activities take 6 minutes for the washing and mixing steps, regardless of how many cookies are being made in the batch. That is, to mix enough dough and ingredients for three dozen cookies takes the same 6 minutes as for one dozen cookies. However, spooning the cookies onto the tray takes 2 minutes per tray. The next step, performed by your roommate, is to put the cookies in the oven and set the thermostat and timer, which in total takes about 1 minute. The cookies bake for the next 9 minutes. So total baking time is 10 minutes, during the first minute of which your roommate is busy setting the oven. Because the oven only holds one tray, a second dozen takes an additional 10 minutes to bake. Your roommate also performs the last steps of the process by first removing the cookies from the oven and putting them aside to cool for 5 minutes, then carefully packing them in a box and accepting payment. Removing the cookies from the oven takes a negligible amount of time, but it must be done promptly. It takes 2 minutes to pack each dozen and about 1 minute to accept payment for the order. This is the process you plan to use to produce cookies by the dozen at Kristen’s Cookie Company. As experienced bakers know, a few simplifications were made in describing the actual cookie production process. For example, the first batch of cookies for the night requires preheating the oven. However, such complexities will be put aside for now. Begin your analysis by developing a process flow diagram of the cookie-making process. Key Questions to Answer Before You Launch the Business To launch the business, you need to set prices and formulate rules for accepting orders. Some issues will be resolved only after you get started and try out different ways of producing the cookies. Before you start, however, you at least want a preliminary plan, with as much as possible specified, so that you can do a careful calculation of how much time you will have to devote to this business each night, and how much money you can expect to make. For example, when you conduct a market survey to determine the likely demand, you will want to specify exactly what your order policies will be. Therefore, answering the following operational questions should help you: This document is authorized for use only by Joel Borellis in Sp23 - NEW VENTURE DSGN/IMPLEMENTATN (06501) at UT Austin MSTC, 2023. Kristen's Cookie Company (A1) 1. How long will it take you to fill a rush order? 2. How many orders can you fill in a night, assuming you are open four hours each night? 3. How much of your own and your roommate’s valuable time will it take to fill each order? 4. Because your baking trays can hold exactly one dozen cookies, you will produce and sell cookies by the dozen. Should you give any discount for people who order two dozen cookies, three dozen cookies, or more? If so, how much? Will it take you any longer to fill a two-dozen cookie order than a one-dozen cookie order? 5. How many electric mixers and baking trays will you need? 6. Are there any changes you can make in your production plans that will allow you to make better cookies or more cookies in less time or at lower cost? For example, is there a bottleneck operation in your production process that you can expand cheaply? What is the effect of adding another oven? How much would you be willing to pay to rent an additional oven? Problems for Further Thought 1. What happens if you are trying to do this by yourself without your roommate? 2. Should you offer special rates for rush orders? Suppose you have just put a tray of cookies into the oven and someone calls up with a “crash priority” order for a dozen cookies of a different flavor. Can you fill the priority order while still fulfilling the order for the cookies that are already in the oven? If not, how much of a premium should you charge for filling the rush order? 3. When should you promise delivery? How can you look quickly at your order board (list of pending orders) and tell a caller when his or her order will be ready? How much of a safety margin for timing should you allow? 4. What other factors should you consider at this stage of planning your business? 5. Your product must be made to order because each order is potentially unique. If you decide to sell standard cookies instead, how should you change the production system? The order-taking process? Other policies? This document is authorized for use only by Joel Borellis in Sp23 - NEW VENTURE DSGN/IMPLEMENTATN (06501) at UT Austin MSTC, 2023.", "1": "New Venture Design And Implementation STC 396 Professor: Edward Anderson Biography Edward G. Anderson Jr. – Wright Prof. for Management of Innovative Technology – Past Director, McCombs Healthcare Innovation Center – Ph.D. Operations Management, MIT; B.S.E.E. & B.A.History, Stanford – Author: The Innovation Butterfly: Managing DistributedInnovation under Emergent Risks & Opportunities,Operations Management for Dummies, 30+ academic and practitioner articles – Advisory Board (Factory Logic, Amer. Epilepsy Inst.), Ford(Operations planning); Consultant (e.g. Shell, Factory Logic, People’s Community Clinic) – Specialties: Supply Chain Design & Disruption, PlatformEconomics, Project (esp. NPD) Management, Healthcare Delivery A Message from Mr. Wonderful “After you make the deal is when the real work begins” --Kevin O’Leary in Beyond the Tank Your MSTC Journey so far You’ve learned how to: • Recognize Worthy Technologies • Identify Markets • Develop Products and Services • Articulate a Business Plan • Finance the Business Some Hard Facts Most tech startups fail to scale after financing • Over 60% of all tech startups fail in 5 years (S. Shane, Case-Western) • 70-80% of VC-funded startups fail to deliver projected returns (S. Ghosh, HBS). • 90-95% of startups that declare a projection fail to meet it (Ghosh, HBS). Why Do Startups Fail AFTER They Have Money??? Reasons • Balance between sales, tech, & ops is lacking (Startup Genome) – Too little funding/too much funding (Ghosh) • Poor assumptions underlying business plan (Ghosh) • Tone-deafness to customer • Lock-in (Ghosh) • Lack of focus (Anderson & Parker) What to do? 1. Build a launch plan – How do we get from business plan to operational viability (~12-18 months after first major money, but can vary by startup) including funding, marketing & sales, R&D, value delivery 2. Assess risks like a pessimist 3. Collect good data, not wishful thinking 4. Design a value delivery strategy 5. Stage your product roll-out 6. Be ready (and willing) to “pivot” to plan B Business Plan vs. Launch Plan Business plan – Defines what the vision is for investors Launch plan – How to achieve the vision for internal use Much like the difference between a Strategy and an Operating plan in a mature firm… SROM Planning Cycle & Pivoting “Plans are nothing. Planning is everything” SCOUT MANEUVER ROADMAP Taken from The Innovation Butterfly by Anderson & Joglekar Course Objectives • Develop a launch plan to realize the vision of the business plan (including platforms) • Provide the tools necessary to create & implement the launch plan • Learn how to identify the risks facing the new venture and how to mitigate their effects. • Design a value delivery strategy consistent with the business model • Recognize when to pivot Administration Course Philosophy Which of these three is most important? • Knowledge • Practice • Talent The Jedi Answer He is strong in the force, but… Talent without training is nothing! Course Philosophy • Your instructor is a coach to facilitate your learning – We will utilize your individual knowledge to help us as appropriate • We will learn by doing… – While not the end product of the MSTC program—the project needs to be viable to get the most out of this class. If the project isn’t viable, contact us ASAP. • …in teams – Your group-work is of extreme importance. If you do not get along with your group, figure it out now. Using tools Value delivery canvas Marketing/Operations matrix Metrics dashboard Fishbone unit cost & revenue analysis Costed work breakdown structure Gantt timing chart and critical path analysis Risk register Risk Scenario ranking Mitigation & contingency plans Failure/pivot triggers, etc. Tentative Course Outline Sessions 1-4: Elaborating the Business Model & Managing its Risks/Opportunities Sessions 5-7: Implementing the Business Model: Value Delivery and Staffing Session 8: Growing the Business Session 9: Launch plan competition Canvas • Syllabus (may be adjusted) • Slides • Cases • Assignments (individual, group, launch plan) • Interesting recent articles from the news Readings The other reading assignments are necessary to fully benefit from the lectures and class. • Operations Management for Dummies • Business Model Generation • Platform Revolution • Design of Ordinary things • Articles in course reading packet – If there is any conflict between our slides and the readings, the slides win. Presentation Schedules Next Session: Value Delivery Canvas Volunteers? Other weeks’ presentations will be assigned by next session. Class/Course Participation • Questions & Comments • Content, not just frequency • Professionalism & Decorum – Video on, no surfing, etc. • Chats • Politeness • Bonus points Statistics If you have not had statistics or are rusty, please watch online Stats Primer video. Link on Canvas… Checklist you should know: • Mean, Median, Mode • Standard deviation • Histogram and probability density function • Normal (Gaussian) distribution • Adding random variables Expectations: We will… • Reply to emails within a business day – Please put “STC 396” in Subject • Be available in my office during office hours and when you have requested an appointment • Grade assignments within one session • Be open and responsive to your feedback E Ink in 2005/2008 Discussion Strategic/Operations Issues Business Canvas & Risks What do you do? Business Model Canvas (for scaling) (e.g investors, suppliers) Unfair Advantage What advantage can your competitors not duplicate? (IP, Patents, Trade (Other than Partners) Secrets, exclusive partners or channels) Value Delivery/Operations Canvas Value Delivery (Operations) Canvas • Processes – the work that needs to be done to deliver the value proposition or service proposition • Organization – the people who will do the work and how they are organized • Locations – where the work is done and what buildings andassets are needed in these locations • Information – the information systems that support the work • Suppliers – what organizations provide inputs to the work and what sort of relationships exist with these organizations • Management systems – the planning, budgeting, performancemanagement, risk management, continuous improvement andpeople management processes needed to run the organization • Unfair Advantage – what deters other potential competitorsfrom taking your market share or making you unprofitable. It could be patents, first mover, trade secrets, etc. Value Delivery Canvas: Toyota Design L Centers Marketing & Sales regions Talent Delegation Kanban P/O Develop to Suppliers IS ment Mrktg ERP + Sales Engine ers Recruitment Assy & Internal parts Plants Home Offices Real-time tracking Forecasting Value Delivery Canvas: Lyft Strong Central Platform, Central IS Pricing, Rating etc. P/O Functions Customer S’ware Geographic Driver Apps Apps Developers Structures Value Delivery Canvas: Disney Software Most Creative Interface VFX P/O Develop People IS Design ment Content Central Vertical’s Production Server Mgt. Recruitment Lines of Systems & Training Business Product Life Cycle Curve Time Suggested Order • Value proposition & Market Segment • Unfair advantage (trade secrets?) • High-level processes • Suppliers & Channels • Locations • People & Organizations • Information Systems Blank Business Model Canvas – E-ink Unfair Advantage Value Delivery Canvas: E-Ink After the Canvases • What are the risks that fall out of the Bus. Model & Value Delivery Canvases? • What are the metrics/dashboard that needs to be looked at? • Do you need to move to plan B (or C or D)? Scratch Paper E Ink Discussion Notes (cont.) Takeaways • Most startups fail – Many startups fail because of a poor launch plan • Pivoting is probable, profitable and propitious • First mover is a weak unfair advantage • You are at the mercy of your supply chain partners, so manage accordingly • Platforms create special risks New Venture Design And Implementation STC 396 Professor: Edward Anderson", "2": "Technology Enterprise Design And Implementation Recurring Unit Cost & Revenue Models Risk Identification & Mitigation An investment in knowledge pays the best interest. --Benjamin Franklin Announcements • Grading • Case writeups • Problem sets Goals • Unit Fishbone costing • Why projects matter to New Venture Implementation • Biases • Why projects fail • Group Assignment 2 presentations • Start -Risk/Opportunity response (risk register) Unit Recurring Cost & Revenue Models Types of Cost • Non-recurring costs – Use project estimation methodologies • Recurring Costs – Fixed vs. variable (Per unit) – Use Fishbone • Revenues (generally per unit) • Subscriptions The Fishbone: An Introduction A Key Driver behind fishbones is the 80/20 Rule Labor Time to Example Fishbone for Serve an attendee Unit Costing: Merchandise Wage Rate Labor The Grateful Dead Cost/attendee Labor Utilization Purchased Merch. Total Merchandise Merch. /attendee Contribution Margin Contr./attendee Merch. VC/attendee Merch. Markup Merch. Flowtime Merch. Holding Contr. Cost/attendee Margin/C oncert Attendees/ concert Net Ticket Ticket Annual Concerts/ Revenue Revenue EBIT year Ticket Price Equipment Lifetime Equipment Depreciation/yr Producer’s % Revenue to Equipment “Cut” Producer Annual Home Purchase Cost Office/yr Example Fishbone for Unit Costing: The Grateful Dead (cont.) Example Fishbone for Unit Costing: The Grateful Dead (cont.) Example Fishbone for Unit Costing: The Grateful Dead (cont.) Labor Time to Example Fishbone for Serve an attendee Unit Costing: Merchandise Wage Rate Labor The Grateful Dead Cost/attendee Labor Utilization Purchased Merch. Total Merchandise Merch. /attendee Contribution Margin Contr./attendee Merch. VC/attendee Merch. Markup Merch. Flowtime Merch. Holding Contr. Cost/attendee Margin/C oncert Attendees/ concert Net Ticket Ticket Annual Concerts/ Revenue Revenue EBIT year Ticket Price Producer’s % Revenue to “Cut” Producer Fixed Costs M.A. Anderson & E.G. Anderson Justifying Your Numbers with Research • The process of finding quantitative data for your business model. – Useful in all facets of planning. • Must find reputable sources (sometimes that takes money, but UT probably can get it for you for free) – Primary sources: Calling up suppliers or distributors – Secondary sources: A reputable source is one which is real ‘news’ or publishes actual statistics (not opinions). • With citations. (e.g. references & how data was collected) Justifying Your Numbers with Research Some of my favorite & reputable sources • NOT Wikiipedia • <BR>https://www.idc.com/ • <BR>http://www.marketingsherpa.com/ • <BR>http://www.census.gov/compendia/statab/ • <BR>http://www.hoovers.com/ • Competitor Websites! • Many more here: http://blog.hubspot.com/marketing/marketresearch-tools-resources • <BR>http://ads.facebook.com/ Goals • Unit Fishbone costing • Why projects matter to New Venture Implementation • Why projects fail • Group Assignment 2 presentations • Risk/Opportunity response (risk register) -Start Secondary Research w/Analysis Example: How many Women in the USA like Golf? Facebook Advertisements (like targeting) AND Census.gov Solution: 157,000,000 women in the USA 76% of women in USA are on Facebook (source Google) [119MM] ***ALWAYS USE CITATIONS*** 500,000 women on Facebook like Golf Do a little algebra: 500,000 / 76% * 157MM = X / 157MM • X = 670,000 Woman in the USA like golf. Notes ZipCar Discussion Unit Cost & Revenue Models Redefining the Business Model Prior to the Business Model Canvas • Who is ZipCar’s customer? • What are the customers’ top 3 problems? • What are the top 3 features of ZipCar’s solution? • What is ZipCar’s unfair advantage? Business Model Canvas Value Delivery Canvas Notes After the Value Delivery Canvas • What are the risks that fall out of the Canvas? • What are the key metrics/dashboard that needs to be looked at? • Do you need to move to plan B (or C or D), i.e. redefine the business model? • We can help answer/elaborate these with a Fishbone Zipcar – Recurring View (Monthly) “Blended Model” Hint: All costs are expressed per month Car Cost / Member Key: May ’00 Biz Plan /Actual September Data 40.19 /67.08 Contribution Margin/Member 90.26 / Monthly Contr.Margin Revenues / Member Plan / Actual ? /6254.63 130.45 / 93.25 Monthly FixedCost ?/ Note: a ‘?’ mark On this ‘hint’ indicates  Members Beginning Members data that is not in the ? / 239 New Members case. Plan / Actual Attrition Lease Costs / Car Access Insurance 723 / Parking Maintenance Fuel Total Members / Car Hours used/month 18 / Utilization Rate Monthly Fee  Uses Monthly Usage Hours / use $ / hour 123.20 / Miles / use Monthly interest $ / Mile 1.00 / $ / member interest rate (%/month) % members Plan / Actual 366.67 / 41.67 / 141.67 / 50.00 / 33.33 / 90.00 / 723.40 / _____ 16 / 40% / 6.25 / 4.00 / 4.00 / 5.50 / 22.0 / 0.40 / 300 / .333 / . ? / ? / 1.2 % / Notes Business Model Evolution • What key changes in the drivers have taken place? Action Plan • What should Robin do? • What key metrics should be on her dashboard to monitor the impact of these changes? Zipcar: People Update • Antje Danielson is no longer with the company – Director of Computer Energy Reduction Program at Harvard • Robin Chase is still at Zipcar, with the title of “Founder and Vice Chair” • New CEO (Scott Griffith) and board hired in early 2003 as condition of further investment by existing investors Robin Chase Zipcar Company Update Since 2003 • Multi-option pricing system – Maximum daily rates increased from $44 to $75-$95 – Boston profitable as of 5/2003 • Now 900,000 members and 10,000 cars in 6 countries – Move into neighborhoods, universities, and business fleets • Cars include Mini Coopers, electric cars, BMWs, pickups, etc. • Merged with Flexcar in 2007 • Firm fully profitable in 2012 • Bought by Avis in 2013 Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson 30 Takeaways Biases Bias Questions • Describe a bias that you’ve run into in practice Risk Management in Launch Planning A Project Management Oriented View Thoughts on Risk “Adventure is just bad planning.” Roald Amundsen “No plan survives contact with the enemy.” Helmuth von Moltke “Plans are nothing. Planning is everything.” Dwight Eisenhower Top 10 Reasons for project schedule slips and budget overruns 1. Insufficient front-end planning 2. Unrealistic project plan 3. Project scope underestimated 4. Customer/management changes 5. Insufficient contingency planning 6. Inability to track progress 7. Inability to detect problems early 8. Insufficient number of checkpoints 9. Staffing problems 10. Technical complexities Survey of project managers’ immediate supervisors from Thamhain&Wilemon, 1986 The Fatal Five 1. Planning – Estimation – Risk planning 2. Scope creep & change 3. Monitoring progress 4. Technological Risk 5. Organizational Risk – Stakeholder & Team Communication – Cement truck test Make Haste…Slowly Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Risk Management Process Manage risk through using a feedback loop…. Risk-Oriented View of Planning Types of risk: • Variance (aka project) risks • Contingencies • Unknown Unknowns (Unk-Unks or Black Swans) Notes", "3": "Scaling Startups A Project Management Oriented View Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Risk Management Project Management Risk Identification Risk Mitigation Recovery Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Project Management “Adventure is just bad planning.” Roald Amundsen Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Five Aspects of Project Management Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson The Central Fact of Project Mgt. Between 75-90% of all completed projects are late, over-budget, or both. Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Top 10 Reasons for project schedule slips and budget overruns 1. Insufficient front-end planning 2. Unrealistic project plan 3. Project scope underestimated 4. Customer/management changes 5. Insufficient contingency planning 6. Inability to track progress 7. Inability to detect problems early 8. Insufficient number of checkpoints 9. Staffing problems 10. Technical complexities Survey of project managers’ immediate supervisors from Thamhain&Wilemon, 1986 Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson The Fatal Five 1. Planning – Estimation – Risk planning 2. Scope creep & change 3. Monitoring progress 4. Technological Risk 5. Organizational Risk – Stakeholder & Team Communication – Cement truck test – Supply chain Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson The Fatal Five 1. Planning – Estimation – Risk planning 2. Scope creep & change 3. Monitoring progress 4. Technological Risk 5. Organizational Risk – Stakeholder & Team Communication – Cement truck test – Supply chain Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson RISK MANAGEMENT Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Planning and Risk “No plan survives contact with the enemy.” Helmuth von Moltke “Everyone has a plan until they get punched in the face.” Mike Tyson Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson “Everyone has a plan until they get punched in the face.” -Mike Tyson Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Risk Management Process Manage risk through using a feedback loop…. Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Risk-Oriented View of Planning Types of risk: • Variance (aka project) risks • Contingencies • Unknown Unknowns (Unk-Unks or Black Swans) Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Notes Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Notes Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Minimizing Variance Risk Probabiity Density LARGE VARIANCE RISK SMALL VARIANCE RISK Activity Cost • Which do you prefer, the black distribution (lower mean, highvariance) ort the blue distribution (higher mean, lowvariance)? Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Minimizing Variance Risk • Usually, Higher Cost Activity Cost •Which do you prefer, the black distribution (lower mean, highvariance) ort the green distribution (higher mean, lowvariance)? LARGE VARIANCE RISK LARGE VARIANCE RISK SMALL VARIANCE RISK, HIGHER COST Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Notes Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Contingency Risk • Base plan has a certain amount of associated uncertainty (variance risk) • However, certain events (contingencies) may have a disproportionate impact on the project. • Should you treat these risks ahead of time? Probability Density Project Base Plan Contingency Occurs Activity Cost Notes Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Unknown Unknowns in the Vernacular The Unknown As we know, There are known knowns. There are things we know we know. We also know There are known unknowns. That is to say We know there are some things We do not know. But there are also unknown unknowns, The ones we don't know We don't know. Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Thoughts on Risk “Plans are nothing. Planning is everything.” Dwight Eisenhower Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Avoiding the “Adventure:” Identifying Risks & Opportunities • Planning: With more information Unk-UnksàContingency/Variance Risks • Mitigated risks • Sources of Risk (FuTBOL) – Funding – Technology (development, IP issues) – Business/Value Canvases (note cross-side externality “chumming” in platforms!) – Organizational (esp. turnover) – Legal/Political/Regulatory • Consider Analogs/Antilogs • Use ‘Evaluating Business Models” questionnaire in Business Model Generation Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Notes Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson An Aside on Brainstorming A suggested approach, the “KJ Diagram” 1. Ask a very specific question 2. Get stakeholders into a group 3. Go around group and ask for an idea/concern/answer forthe question. 4. Facilitator(s) put it onto a post-it 5. Repeat until ideas trickle off 6. Group clusters ideas into groups of 5-10 that are similar – Hint: don’t try to rationalize the groups at this point 7. Give a name to each cluster 8. Determine risks/opps/metrics associated with each cluster – Use different color post-it for this step Remember at all times that this is a brainstorming session. There is no need to “weed out” ideas. Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Coping with Risks & Opportunities • Responses: The 4 T’s: – Treating (eliminating/mitigating up-front) – Transferring (e.g. hedging, or to a supplier) – Taking (often with contingency plans and metrics, esp. common with opportunities) – Terminating (reducing the project scope or abandoning the project as a whole). • Response plans can be a mixture of the 4T’s. • Contingency plans must have trigger conditions • Need a tool to prioritize and keep track of risks Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Notes Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Risk Register • Risks (and uncertainties) must be kept track of – The usual tool for this is some variant of a “risk register” • Not all risks are created equal, so they are “scored” for prioritization. – Expected value – Qualitative – Warning: Some risks could be correlated! • There is also an “opportunity” register (you’ll build one in your homework). • Risk/Opportunity registers (and response plans) must be continually updated. Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Fictitious Example: ExxonMobil’s Melville Island Tar Sands Project • One of the world’s greatest sources of Tar Sands (aka Oil Shale or heavy Oil). • 1200 miles from Churchill, the nearest major port • Ice-bound half the year • No permanent port or settlement Melville Island Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Sample Risk Register for Melville Island Tar Sands Project Contingency plans should include trigger points Unmitigated Risk Score Mitigated Risk Score ID No. Event Risk Risk Category Unmitigated Likelihood** Unmitigated Impact** (Likelihood x Impact) Mitigation/Contingency Plan Mitigated Likelihood** Mitigated Impact** (Likelihood x Impact) Owner 1Lack of skilled labor willing to relocate Operation becomes infeasible Organizait on Medium (3) Very High (5) 15 Combination of incentives, plus onsite education Low (2) High (4) 8 2Cannot find another oil commany to partner with Entire risk born by ExporiCo if failure Funding Medium (3) High (4) 12 Terminate if partner not found inside of a year Very Low (1) Very Low (1) 1 3Environmental impact statement unfavorable Extra cost to insure low impact on wildlife Legal High (4) Medium (3) 12 Hire lobbyists Low (2) Medium (3) 6 4Cannot acquire land from Canadian Government Project Untenable Business Canvas Low (2) Very High (5) 10 Lobbyists + early terminate if cannot acquire land in 2 yrs Very Low (1) High (4) 4 5No good natural harbor Delay of possibly one year Tech. Low (2) Very High (5) 10 Start Scouting now, and terminate if delay > 1 year Low (2) Medium (3) 6 6Not enough icebreakers available for rent Lose 6 months of port usability per year Business Canvas Low (2) Very High (5) 10 Put option out on icebreakers Very Low (1) High (4) 4 8Environmental advocacy group protests Some bad publicity Legal High (4) Very Low (1) 4 No need for repsonse plan High (4) Very Low (1) 4 Risk Score Colors: Red • Risk Score >10; Yellow • 5 < Risk Score <=10 ; Green • Risk Score < 5 Note that there really should be an “owner” column on the right. Why? Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Notes Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson And if You Run Into a Black Swan… Make Haste…Slowly Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Craft Bourbon Example Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Craft Bourbon Market • Hipsters/Millennials are very interested in ”hand-crafted,” authentic bourbon. • For your demographic you’ll need to age the bourbon after distillation for two years prior to selling it. • You will need to determine a marketing plan. – The market is very crowded – You’ll need to design a bottle and label design that’s unique, as well as creating a story for yourself that will differentiate your brand in the market. – There are many ways to market your brand. One way to do this is to buy booth space at a whiskey expo yourself or at individual retailers. • Opening a distillery takes 4 – 8 million dollars. • Alternative to a distillery is to outsource your whiskey from MGP and then outsource bottling to a local bottler. Variable cost per gallon sold is about 50% higher, but you can sell it immediately. Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Craft Bourbon Market • One trick to raise revenue is to build a tasting room. – People who visit the tasting room can legally buy your bourbon, but you won’t lose the 50% of the retail price to the distributor and retailer. Of course it costs about a $1M to build, and you need to staff it. • Industry is heavily regulated • You cannot sell without finding a distributor. – You need them more than they need you. – The distiller and retailer take 50% of the MSRP. – Distributors will experiment with placing your product at select retailers for a trial period. After that, you’ll get shelf space in proportion to how much you sell. • You also need to get licensed, arrange to pay taxes etc. Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson In-Class Assignment: Risk Registers 1. Break up into groups. 2. Assume that you are creating your own startup bourbon brand. 3. Name your bourbon! 4. Please identify 5 risks & 1 opportunity. One risk should come from each of the FuTBOL categories. The opportunity can come any category. 5. Rate the likelihood and severity of each risk on a 1-5 scale – 1=very low, 2 = low, 3 = medium, 4 = high, 5 = very high – The composite risk factor is the product of the likelihood of a risk (on the 1-5 scale) and its severity (on the 1-5 scale). 6. Identify potential mitigation/contingency plans for each of the 5 risks (based on your risk score). Identify the trigger conditions. Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Notes Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Notes Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Takeaways Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Risk Management Project Management Risk Identification Risk Mitigation Recovery Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson", "4": "Timing & Recurring Cost Estimation Project estimation fundamentals Work breakdown structure Critical path Padding & Variability Work Breakdown Structure Or? -Roman Proverb Time and Money • We have estimated variable and recurring fixed costs with the fishbone. However: • We still need to estimate non-recurring fixed costs (or sunk costs); • Central problem of project management is partly due to estimation • We must estimate timing of the project. Planning and Estimation Tools The essence of project management is using easy-to-understand visual scheduling methods.. Work Breakdown Structure (WBS) Explains exactly what needs to be done The Gantt Chart Simple and easy to explain to uninitiated Critical Path Method (CPM) Explicitly represents dependencies. Enables Time/cost trade-offs Program Evaluation & Review Technique (PERT) Introduces mechanisms to cope with uncertainty Work Breakdown Structure Avoiding estimation biases What is a Work Breakdown Structure (WBS)? • Organized list of all the activities you need to complete your project • Details scope • Foundation for accurate cost/schedule estimates • Foundation for monitoring progress • Creates ownership for each activity WBS Example Each activity has a verb and High-Level an object Activity WBS (Paragraph Form) So How Do You Get a WBS? • Easier to start from top-down, but then start fromlook from bottom up • Brainstorm • Interview experts OR Don’t forget planning activities! Initial WBS Estimation Add timing and cost • Estimation for a project is better from the bottom up • Hence, adjust the WBS to break up (or aggregate) theactivities into easy-to-estimate chunks (8/80 rule) • Assume 100% utilization of employees Use analogous historical data if at all possible ‒Then use logic ‒Then use 3-point estimation from PERT from experts ‒Even for CPM Once you do have CP done, check final bottom-up estimateagainst top-down experience/expectation WBS Do’s and Don’ts • Do have AN OWNER who is responsible for completing each activity • Do not worry about chronological order • If you use agile sprints, just represent each sprint asan activity • Living Document! Wedding Planner Exercise Break into your groups and create a WBS for holding a wedding. – Decide first what type of wedding you want (i.e. your project purpose) – Each of you first write down what you guess the wedding should cost (individually, no collaborating) – Include at least 20 activities. Remember to include ancillary activities such asreserving hotel space for guests, planning the honeymoon, taking honeymoon, writing thank you cards, etc. – Assign an estimated cost and timing for each activity. – Make sure to use at least four summary tasks and assign a responsible person for each activity. – Use paragraph form for your WBS. Excel or Word is probably best choice for App. – Total up your costs at the end. How did they compare? Be prepared to defend your WBS in front of the class as a whole! Critical Path Handling the ”Person-month Myth” A Simple Gantt Example The “River Clean-Up” Project: Activity Description Duration A Get Funding Clearance 4 weeks B Recruit Volunteers 4 weeks C Get Equipment 2 weeks D Train Volunteers on Equipment 1 week E Clean River 4 weeks weeks 0 4 812 16 Critical Path Method (CPM) Developed by DuPont in 1950s for opening and closing plants. Step by Step 1) Determine activities, time estimates, and precedence (what depends on what) relationships. 2) Draw the network diagram • activities are nodes • precedence (dependence) relationships are arrows • Begin with a “start” node, draw an arrow from the start node to all the activities without predecessors • Finish with an “end” node. Draw arrows from all the activities without accessories to this “end” node. A Couple of Tips for Drawing Use a pencil or computer. You’ll need more than one iteration You should always add “dummy” start and end nodes. This is particularly helpful: -If there are two or more activities with no predecessors A, 7 Start, 0 -If there are two or more activities with no successors R, 3 End, 0 X, 2 Critical Path Method (CPM) Step by Step (cont.) 3) Perform a Forward Path Analysis • Earliest start (ES) is 0 for the “start” activity. • Calculate the ES and EF for each activity • For each subsequent activity, EF = ES + activity duration • ES for an activity = Maximum of all its predecessors’ EF’s 4) Perform a Backward Path Analysis • LF (latest finish) is EF for the “end” node • Working backwards, calculate LS and LF (latest finish) for each activity • LF = minimum of all the successor activities’ LS’s • LS = LF – activity duration for all activities • At the end, the LS for the “start” node should be zero. 5) Establish slacks (time you can delay activity without violating latest finish ie LF-EF) and the critical path (the path that determines time of project) Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Labeling Conventions ESi EFi i, di LSi LFi ESi – Earliest Start for node i LSi – Latest Start for node i EFi – Earliest Finish for node i LFi – Latest Finish for node i i, di -node i has duration of di CPM Example What do you do first? CPM Example – Network Diagram First, we calculate the earliest possible start and finish times for each activity. CPM Example – Forward Path 0 Then, we calculate the latest possible start and finish times for each activity. These latest times will not compromise the schedule of the project as a whole. CPM Example – Backward Path 0 Then, we calculate the latest possible start and finish times for each activity. These latest times will not compromise the schedule of the project as a whole. CPM Example – Slack 0 CP= (Total) Slack (aka total float) is the latest you can delay the completion of an activity without delaying the project as a whole. Slacki= LSi – ESi. The critical path(s) contains those activities with zero slack. Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Confirming the Critical Path To check whether you have correctly identified the critical path, make sure it’s the path with the longest duration. The critical path always has the longest duration. Duration St-DGHIJK-End = 30 + 0.25 + 0.25 + 0.25 + 0.15 + 0.3 = 31.2 Duration St-AGHIJK-End = 1 + 0.25 + 0.25 + 0.25 + 0.15 + 0.3 = 2.2 Duration St-BCFIJK-End = 21 + 7 + 0.5 + 0.25 + 0.15 + 0.3 = 29.2 Duration St-BCIJK-End = 21 + 7 + 0.25 + 0.15 + 0.3 = 28.7 Duration St-BEJK-End = 21 + 2 + 0.15 + 0.3 = 23.45 Etc. • St-DGHIJK-End is the critical path, because it’s the longest! Note are there any paths that are almost as long as the critical path? (These are oftentimes called near critical paths.) A Simple Gantt Example (Boy Scout Eagle Project) 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 Label Activity A Select site with client B Recruit volunteers C Get landscaping tools D Secure donations E Build park benches F Obtain landscaping materials F Landscape site Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson A Small Issue: Resource Conflicts What is the critical path for the diagram below? A Small Issue: Resource Conflicts What is the critical path for the diagram below? CPM and Crashing What activities might you consider spending extra resources (either thru overtime or additional assets) on to “crash” (i.e. accelerate the schedule of) a project? Of course, one consideration is that you’d want to spend on the activity that’s cheapest to crash. Are there any other considerations? PERT Incorporating Variance Risks Problems with CPM CPM is completely deterministic – We cannot make any sort of probabilistic estimates such as a P90. – If we use the most likely estimate for duration, the CP estimate will be too short. – Conservatism often tends to create overlong projections (padding), leading to ”negotiation dance.” One way to get around these issues is to accept that “Estimates aren’t points, they are probabilistic distributions” Or in layman’s terms “Estimates are not points, they are ranges” Why do we need PERT? • Ranges work better to ameliorate the “estimation dance. But how do we calculate appropriateranges? • Determine how much to pad when single-pointestimates are used. • How do we account for the benefit of mitigatingvariance risks? Uncertainty in Task (Activity) Duration Probability m mode ba 5% Most 95% Duration Likely 3-Point PERT Activity Estimation 5% Mode/Most 95% Duration Likely Expectation (i.e.mean) = 0.63* m+ 0.185*(a+ b) 2 $ &% b-a ! ≠ Std. Deviation Note: These are modified from the Variance = \" 3.25 traditional PERT formulas by modern research. If you take a PMP exam, you’ll b-a want to use different formulas! See the OMD book for traditional formulas. 3.25 Standard Deviation = Now we estimate the expectation (mean) and the variance for each activity.. Technology Enterprise Design and Implementation: STC 396 M.A. Anderson & E.G. Anderson Activity Estimation Example You are remodeling your house. The contractor estimates that the activity of remodeling your kitchen has minimum, most likely, and pessimistic estimates of $13,000, $25,000, and $65,000. What is your cost estimate for your expected cost and standard deviation? Cost Example Work Calculating Project Cost Probabilities Now that we have estimates for each of our activities, we can make use of the Central Limit Theorem to calculate overall project cost probabilities. • Determine each activity’s cost. • Add all the expected (i.e. mean) activity costs. • Add together all the activity variances. • Only then take the square root of the total variance to get the project’s standard deviation. --Do NOT add Activity Standard Deviations. • Voila, the project cost distribution will have an approximately normal distribution via the CLT. Now we can calculate the probability of different scenarios. Example Mean Duration Std. Deviation Mean Cost Std. Deviation Activity Description Predecessors (months) (months) (Dollars) (Dollars) Allocated Resource(s) A Architecture none 2 0.8 $8,000 $3,200 Alice B Internal design A 5 3 $20,000 $12,000 Edmond C Internal build B 2.5 1 $10,000 $4,000 Edmond D External design A 4 4 $16,000 $16,000 Mikayla E External build D 3 2 $12,000 $8,000 Mikayla F Integration I C,E,G 1.5 0.5 $6,000 $2,000 Sam G Self-test A 4 2 $16,000 $8,000 Toni H Assembly F 1.6 0.5 $6,400 $2,000 George J Integration II H 2.3 0.7 $9,200 $2,800 Sam K Acceptance test B,D 3 1 $12,000 $4,000 Dolly L Final test J, K 1.8 0.4 $7,200 $1,600 Paula Cost Example (cont’d) What is the probability the project is completed for $150K or less? Project Cost Bell Curve 0.5 0.4 0.3 0.2 0.1 0 50 100 150 200 Project Cost Probability Density Common Z-values A “PXX” value is the XXth percentile of a distribution. To find PXX, use the formula below, which is true for any normally distributed random variable: PXX = µ + zPXX σ P-value Z P05 -1.64 P10 -1.28 P50 0 P90 1.28 P95 1.64 Z-Chart for Project and Inventory Management Z F(Z) Z F(Z) Z F(Z) Z F(Z) Z F(Z) Z F(Z) -3.00 0.13% -2.00 2.28% -1.00 15.87% 0.00 50.00% 1.00 84.13% 2.00 97.72% -2.96 0.15% -1.96 2.50% -0.96 16.85% 0.04 51.60% 1.04 85.08% 2.04 97.93% -2.92 0.18% -1.92 2.74% -0.92 17.88% 0.08 53.19% 1.08 85.99% 2.08 98.12% -2.88 0.20% -1.88 3.01% -0.88 18.94% 0.12 54.78% 1.12 86.86% 2.12 98.30% -2.84 0.23% -1.84 3.29% -0.84 20.05% 0.16 56.36% 1.16 87.70% 2.16 98.46% -2.80 0.26% -1.80 3.59% -0.80 21.19% 0.20 57.93% 1.20 88.49% 2.20 98.61% -2.76 0.29% -1.76 3.92% -0.76 22.36% 0.24 59.48% 1.24 89.25% 2.24 98.75% -2.72 0.33% -1.72 4.27% -0.72 23.58% 0.28 61.03% 1.28 89.97% 2.28 98.87% -2.68 0.37% -1.68 4.65% -0.68 24.83% 0.32 62.55% 1.32 90.66% 2.32 98.98% -2.64 0.41% -1.64 5.05% -0.64 26.11% 0.36 64.06% 1.36 91.31% 2.36", "5": "99.09% -2.60 0.47% -1.60 5.48% -0.60 27.43% 0.40 65.54% 1.40 91.92% 2.40 99.18% -2.56 0.52% -1.56 5.94% -0.56 28.77% 0.44 67.00% 1.44 92.51% 2.44 99.27% -2.52 0.59% -1.52 6.43% -0.52 30.15% 0.48 68.44% 1.48 93.06% 2.48 99.34% -2.48 0.66% -1.48 6.94% -0.48 31.56% 0.52 69.85% 1.52 93.57% 2.52 99.41% -2.44 0.73% -1.44 7.49% -0.44 33.00% 0.56 71.23% 1.56 94.06% 2.56 99.48% -2.40 0.82% -1.40 8.08% -0.40 34.46% 0.60 72.57% 1.60 94.52% 2.60 99.53% -2.36 0.91% -1.36 8.69% -0.36 35.94% 0.64 73.89% 1.64 94.95% 2.64 99.59% -2.32 1.02% -1.32 9.34% -0.32 37.45% 0.68 75.17% 1.68 95.35% 2.68 99.63% -2.28 1.13% -1.28 10.03% -0.28 38.97% 0.72 76.42% 1.72 95.73% 2.72 99.67% -2.24 1.25% -1.24 10.75% -0.24 40.52% 0.76 77.64% 1.76 96.08% 2.76 99.71% -2.20 1.39% -1.20 11.51% -0.20 42.07% 0.80 78.81% 1.80 96.41% 2.80 99.74% -2.16 1.54% -1.16 12.30% -0.16 43.64% 0.84 79.95% 1.84 96.71% 2.84 99.77% -2.12 1.70% -1.12 13.14% -0.12 45.22% 0.88 81.06% 1.88 96.99% 2.88 99.80% -2.08 1.88% -1.08 14.01% -0.08 46.81% 0.92 82.12% 1.92 97.26% 2.92 99.82% -2.04 2.07% -1.04 14.92% -0.04 48.40% 0.96 83.15% 1.96 97.50% 2.96 99.85% 3.00 99.87% Z is the z-score of a value, which is the number of standard deviations F(z) Z the value is above the mean. F(Z) is the probability that a random variable that is normally distributed will be less than or equal to Z standard deviations above the mean. -For inventory management, F(Z) is the service level for a quantity Special Values 5.00% -1.64 10.00% -1.28 25.00% -0.67 50.00% 0.00 ordered that is Z standard deviation above the mean. 0 z -For project management, F(Z) is the P-value (e.g. P05, P65, etc.) for a 75.00% 0.67 90.00% 1.28 time or cost that is Z standard deviations above the mean. 95.00% 1.64 Cost Example (cont’d) What is a budget that you can guarantee with 90% Certainty (i.e. a P90 estimate)? Project Cost Bell Curve 0.5 0.4 0.3 0.2 0.1 0 50 100 150 200 Project Cost How about a P50 or a P10? Probability Density Cost Example Work Estimating Timing Schedules Using PERT Step by Step.. 1) Determine activities, time estimates, and precedence relationships. 2) Use historical data or 3-point estimate for each activity using a, m, b 3) Draw the network diagram 4) Do Forward and Backward Path Analysis 5) Establish slacks and the critical path 6) Calculate project completion statistics •Expected duration is sum of expected activity times on critical path •Variance of duration is sum of variances on critical path •Standard deviation is the square root of the variance •The duration is normally distributed via the CLT We can use activity statistics to make statements about project duration.. Recall: Cost and Timing Example Mean Duration Std. Deviation Mean Cost Std. Deviation Activity Description Predecessors (months) (months) (Dollars) (Dollars) Allocated Resource(s) A Architecture none 2 0.8 $8,000 $3,200 Alice B Internal design A 5 3 $20,000 $12,000 Edmond C Internal build B 2.5 1 $10,000 $4,000 Edmond D External design A 4 4 $16,000 $16,000 Mikayla E External build D 3 2 $12,000 $8,000 Mikayla F Integration I C,E,G 1.5 0.5 $6,000 $2,000 Sam G Self-test A 4 2 $16,000 $8,000 Toni H Assembly F 1.6 0.5 $6,400 $2,000 George J Integration II H 2.3 0.7 $9,200 $2,800 Sam K Acceptance test B,D 3 1 $12,000 $4,000 Dolly L Final test J, K 1.8 0.4 $7,200 $1,600 Paula Scheduling Example CP Diagram Scheduling Example (cont’d) What are the P10, P50, and P90 estimates for timing? Implications for Risk Management How is “crashing” different once you account for risk? Which estimate should you give your investor/manager in terms of contingency budget? The P50, the P95, etc.? A Couple of PERT Caveats • Do NOT use the PERT-like functions in Microsoft Project. They add together P95s for each activity (essentially adding std. devations), thus overestimating project P95s. • The “modern 3-point” formulas in this presentation are more modern (and accurate) than the normal formulas you’ll find if you look online or in a reference book. The modern formulas weight the tails more heavily and account for the fact that people have trouble estimating true maxima and minima. • PERT designed for variance risk management. Need simulation to bring in contingency risks from risk register. Not Perfection There are some significant issues when using a CPM/PERT approach to project management. • Can’t handle serious technological/market uncertainty well (in this case, need an agile development process ) – Rapid design-build-test cycles are increasingly more common even with physical products, esp. using simulation • Use can promote a sequential mindset – Promotes handoffs & decreases teamwork – Concurrency is often quicker & cheaper • Critical paths can change if slacks are violated – It’s a living document Takeaways Takeaways 2 Timing & Recurring Cost Estimation Project estimation fundamentals Work breakdown structure Critical path Padding & Variability Recapping with Rap"}